export const GAME_NAMES = Object.freeze({
  POKER: 'ΠΟΚΕΡ',
  TEXAS_HOLDEM: 'TEXAS HOLDEM',
  QUEEN: 'FOLLOW THE QUEEN',
  RAILROAD: 'ΣΙΔΗΡΟΔΡΟΜΟΣ',
  MAMUT: 'ΜΑΜΟΥΘ',
  TRIANGLE: 'ΤΡΙΓΩΝΟ',
  SQUARE: 'ΤΕΤΡΑΓΩΝΟ',
  CORNER: 'ΓΩΝΙΑ',
  CROSS: 'ΣΤΑΥΡΟΣ',
  TARGET: 'ΣΤΟΧΟΣ',
  CLOCK: 'ΡΟΛΟΙ',
  ELEVATOR: 'ΑΝΣΑΝΣΕΡ',
  PYRAMID: 'ΠΥΡΑΜΙΔΑ',
  GRAVEYARD: 'ΝΕΚΡΟΤΑΦΕΙΟ',
  KOYKOS_MONOS: `ΚΟΥΚΟΣ ΜΟΝΟΣ / "ΠΑΖ ΑΒΟΛΟΝΤΕ"`,
  KOYKOS_DIPLOS: `ΚΟΥΚΟΣ ΔΙΠΛΟΣ / "ΑΒΟΛΟΝΤΕ"`,
});

export const BUILDER_ROW_TITLE = Object.freeze({
  GAME: 'ΠΑΙΧΝΙΔΙ',
  WINNING_ORDER: 'ΝΙΚΗΤΗΡΙΑ ΣΕΙΡΑ',
  CARDS_IN_HAND: 'ΧΑΡΤΙΑ ΣΤΟ ΧΕΡΙ',
  HAND_CARDS_IN_PLAY: 'ΠΑΙΖΟΥΝ ΑΠΟ ΤΟ ΧΕΡΙ',
  DEALING: 'ΜΟΙΡΑΣΜΑ',
  DEALING_OPTIONS: 'ΕΠΙΛΟΓΕΣ ΜΟΙΡΑΣΜΑΤΟΣ',
  OPTIONS: 'ΕΠΙΛΟΓΕΣ',
  EXTRA: 'ΕΞΤΡΑ',
  RAILROAD_LENGTH: 'ΧΑΡΤΙΑ ΣΤΟ ΤΡΑΠΕΖΙ',
  FACE_DOWN: 'ΚΛΕΙΣΤΑ ΧΑΡΤΙΑ',
  CARDS_PER_LEG: 'ΧΑΡΤΙΑ ΑΝΑ ΣΚΕΛΟΣ',
  TABLO: 'ΤΑΜΠΛΟ',
  SPEAKS: 'ΜΙΛΑΕΙ',
});
export const WINNING_ORDERS = Object.freeze({
  KENTA_CHROMA: 'ΚΕΝΤΑ ΧΡΩΜΑ',
  TRIA_FOUL: '3 ΦΟΥΛ',
  KENTA_FOUL: 'ΚΕΝΤΑ ΦΟΥΛ',
  MIZERIA: 'ΜΙΖΕΡΙΑ',
});
export const DEALING_KIND = Object.freeze({
  ENA_ENA: 'ΕΝΑ ΕΝΑ',
  OLA_MAZI: 'ΟΛΑ ΜΑΖΙ',
});
export const SPEAKING_ORDER = Object.freeze({
  BY_VALUE: 'ΤΟ ΚΑΛΥΤΕΡΟ ΑΝΟΙΚΤΟ ΦΥΛΟ',
  BY_SEAT: 'ΜΕ ΤΗΝ ΣΕΙΡΑ',
});
export const TABLOS = Object.freeze({
  MONO: 'ΜΟΝΟ',
  DIPLO: 'ΔΙΠΛΟ',
});
export const POSSESSIVE_CARD_NAMES = Object.freeze([
  '',
  '',
  ' ΔΥΟ',
  ' ΤΡΙΑ',
  ' ΤΕΣΣΕΡΑ',
  ' ΠΕΝΤΕ',
  ' ΕΞΙ',
  ' ΕΦΤΑ',
  ' ΟΚΤΩ',
  ' ΕΝΝΕΑ',
  ' ΔΕΚΑ',
  ' ΒΑΛΕ',
  ' ΝΤΑΜΑΣ',
  ' ΡΗΓΑ',
  ' ΑΣΣΟΥ',
]);
export const PLURAL_CARD_NAMES = Object.freeze([
  '',
  '',
  ' ΔΥΑΡΙΑ',
  ' ΤΡΙΑΡΙΑ',
  ' ΤΕΣΣAΡΙΑ',
  ' ΠΕΝΤΑΡΙΑ',
  ' ΕΞΑΡΙΑ',
  ' ΕΦΤΑΡΙΑ',
  ' ΟΚΤΑΡΙΑ',
  ' ΕΝΝΙΑΡΙΑ',
  ' ΔΕΚΑΡΙΑ',
  ' ΒΑΛΕΔΕΣ',
  ' ΝΤΑΜΕΣ',
  ' ΡΗΓΑΔΕΣ',
  ' ΑΣΣΟΥΣ',
]);
export const HANDKIND = Object.freeze({
  SITTING_OUT: 'ΕΚΤΟΣ ΤΡΑΠΕΖΙΟΥ',
  AUTO_SITTING_OUT: 'ΑΠΩΛΕΙΑ ΣΥΝΔΕΣΗΣ',
  FOLDED: 'ΠΑΣΟ',
  HIGH_CARD: 'ΠΕΝΤΑΦΥΛΛΙΑ',
  PAIR: 'ΖΕΥΓΑΡΙ',
  TWO_PAIRS: 'ΖΕΥΓΑΡΙΑ',
  THREE_OF_A_KIND: 'ΤΡΙΑΔΑ',
  STRAIGHT: 'ΚΕΝΤΑ',
  FULL_HOUSE: 'ΦΟΥΛ',
  FLUSH: 'ΧΡΩΜΑ',
  FOUR_OF_A_KIND: 'ΚΑΡΕ',
  STRAIGHT_FLUSH: 'ΦΛΟΣ',
  MIRROR: 'ΚΑΘΡΕΦΤΗΣ',
  ALL_DISCARDED: '"ΞΕΣΚΑΡΤΑΡΙΣΜΑ"',
  SCOOP: 'ΣΚΟΥΠΑ',
});
export const INFO_TEXT = Object.freeze({
  SKARTO:
    '+1 επιπλέον χαρτί μαζί με το τελευταίο και άμεσως ξεσκαρτάρισμα ενός.(αν έχετε επιλέξει π.χ 3 χαρτιά για το χέρι,θα πάρετε 4 και θα απορρίψετε ένα, συνιστάται μοίρασμα ΟΛΑ ΜΑΖΙ ).',
  ARNISI:
    'Τα χαρτιά μοιράζονται ΕΝΑ ΕΝΑ, με αναμονή σε κάθε παίκτη να αποφασήσει αν θα το κρατήσει η θα πάρει άλλο (για όσα χαρτιά επιλέξετε).',
  ALAGI:
    'Αλλαγή όσων χαρτιών επιλέξετε, αφού πάρετε στα χέρια όλα τα χαρτιά και έχετε ποντάρει.',
  HAT: '"Παίζει" μόνο ένα από το καπέλο.',
  BOMBA: `Τα χαρτιά του τραπεζιού (εκτός αυτών του καπέλου) "σκάνε' όλα μαζί.`,
  [DEALING_KIND.ENA_ENA]:
    'Μοιράζεται από ένα χαρτί σε κάθε παίκτη, ακολουθεί ποντάρισμα, ανοίγει ένα χαρτί στο τραπέζι (αν υπάρχει) και ακολουθεί ποντάρισμα κ.ο.κ ',
  [DEALING_KIND.OLA_MAZI]:
    'Μοιράζονται όλα τα χαρτία σε παίκτες και στο τραπέζι και ακολουθούν εναλάξ πονταρίσματα και ανοίγματα των χαρτιών του τραπεζιού.',
  KAVES: `Οι παίκτες που αναγράφονται σε κάθε κάβα, διεκδικούν αυτήν συν όλες όσες βρίσκονται από επάνω της. Οι υπόλοιποι διεκδικούν όλο το πότ.`,
});
export const SUIT_NAME = Object.freeze({
  C: 'ΣΠΑΘΙ',
  H: 'ΚΟΥΠΑ',
  S: 'ΜΠΑΣΤΟΥΝΙ',
  D: 'ΚΑΡΟ',
});
export const SYMBOLS = Object.freeze({
  11: 'J',
  12: 'Q',
  13: 'K',
  14: 'A',
});
export const ORDER_NAME = Object.freeze([
  'ΠΡΩΤΟ',
  'ΔΕΥΤΕΡΟ',
  'ΤΡΙΤΟ',
  'ΤΕΤΑΡΤΟ',
  'ΠΕΜΠΤΟ',
  'ΕΚΤΟ',
  'ΕΒΔΟΜΟ',
]);
export const ORDER_NUMBER = Object.freeze(['1ο', '2ο', '3ο', '4ο', '5ο']);
export const COUNT = Object.freeze(['', 'ΜΟΝΟ', 'ΔΙΠΛΟ', 'ΤΡΙΠΛΟ']);
export const COUNT_FEM = Object.freeze([
  '',
  'ΜΙΑ',
  'ΔΥΟ',
  'ΤΡΕΙΣ',
  'ΤΕΣΣΕΡΕΙΣ',
  'ΠΕΝΤΕ',
  'ΕΞΙ',
  'ΕΦΤΑ',
]);
export const INFO_BUTTONS_TITLES = Object.freeze({
  GAME_DESCRIPTION: 'ΠΕΡΙΓΡΑΦΗ',
  GAME_INFO: 'ΠΑΡΑΛΛΑΓΗ',
  LAST_GAME_RESULTS: 'ΑΠΟΤΕΛΕΣΜΑ',
  STANDINGS: 'ΚΑΤΑΤΑΞΗ',
  CHAT: 'ΚΟΥΒΕΝΤΑ',
});
export const GAME_INFO = Object.freeze({
  [GAME_NAMES.RAILROAD]: {
    ΔΙΑΤΑΞΗ: 'Όσα χαρτιά επιλέξετε σε μία ευθεία.',
    ΟΜΑΔΕΣ: 'Διαλέγετε οποιαδήποτε από αυτά.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ένα ένα.',
  },
  [GAME_NAMES.MAMUT]: {
    ΔΙΑΤΑΞΗ: 'Τρία χαρτιά σε ευθεία.',
    ΟΜΑΔΕΣ: 'Διαλέγετε οποιαδήποτε από αυτά.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ένα ένα.',
    ΕΠΙΛΟΓΕΣ:
      'Δυνατότητα επιλογής καθρέφτη (ίδιας αξίας χαρτιά στο χέρι\n και στο τραπέζι) ως ανώτατο φύλλο.',
  },
  [GAME_NAMES.TRIANGLE]: {
    ΔΙΑΤΑΞΗ: 'Ισόπλευρο τρίγωνο τριών χαρτιών ανα πλευρά.',
    ΟΜΑΔΕΣ: 'Διελέγετε χαρτιά από μία πλευρά μόνο.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ανά τρία, πρώτα οι γωνίες.',
  },
  [GAME_NAMES.SQUARE]: {
    ΔΙΑΤΑΞΗ: 'Τετράγωνο δύο χαρτιών ανά πλευρά.',
    ΟΜΑΔΕΣ: 'Διελέγετε χαρτιά από μία πλευρά μόνο.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ανά δύο διαγώνια.',
  },
  [GAME_NAMES.KOYKOS_MONOS]: {
    ΔΙΑΤΑΞΗ: 'Πέντε χαρτιά στο τραπέζι σε ευθεία.',
    ΟΜΑΔΕΣ: 'Διαλέγετε οποιαδήποτε από αυτά.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ένα ένα.',
  },
  [GAME_NAMES.KOYKOS_DIPLOS]: {
    ΔΙΑΤΑΞΗ: 'Πέντε χαρτιά στο τραπέζι σε ευθεία.',
    ΟΜΑΔΕΣ: 'Διαλέγετε οποιαδήποτε από αυτά.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ένα ένα.',
  },
  [GAME_NAMES.POKER]: { ΔΙΑΤΑΞΗ: 'Κανένα χαρτί στο τραπέζι.' },
  [GAME_NAMES.TEXAS_HOLDEM]: {
    ΔΙΑΤΑΞΗ: 'Πέντε χαρτιά στο τραπέζι σε ευθεία.',
    ΟΜΑΔΕΣ: 'Διαλέγετε οποιαδήποτε από αυτά.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα των τριών πρώτων αρχικά και ενός ενός ύστερα.',
  },
  [GAME_NAMES.TARGET]: {
    ΔΙΑΤΑΞΗ: 'Έξι χαρτιά σε διάταξη κύκλου και ένα στο κέντρο.',
    ΟΜΑΔΕΣ:
      'Διαλέγετε από οποιαδήποτε δύο συνεχόμενα χαρτιά απο την περιφέρεια\n και το χαρτί του κέντρου.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ανά δύο αντιδιαμετρικά και στο τέλος το κέντρου.',
  },
  [GAME_NAMES.CLOCK]: {
    ΔΙΑΤΑΞΗ: 'Έξι χαρτιά σε διάταξη κύκλου.',
    ΟΜΑΔΕΣ:
      'Διαλέγετε από οποιαδήποτε τρία συνεχόμενα χαρτιά απο την περιφέρεια.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ανά δύο αντιδιαμετρικά',
  },
  [GAME_NAMES.ELEVATOR]: {
    ΔΙΑΤΑΞΗ: 'Δύο στήλες των τριών χαρτιών και μία ενδιάμεση του ενός.',
    ΟΜΑΔΕΣ:
      'Διαλέγετε από το ενδιάμεσο χαρτί, από ένα χαρτί της πρώτης στήλης\n και το αντίστοιχο χαρτί της δεύτερης.',
    ΑΝΟΙΓΜΑ:
      'Άνοιγμα κάθε στήλης χωριστά και στο τέλος του ενδιάμεσου χαρτιού.',
  },
  [GAME_NAMES.GRAVEYARD]: {
    ΔΙΑΤΑΞΗ:
      'Δύο πεντάδες χαρτιών, η πάνω αποτελείται από τα "νεκρά" χαρτιά.\n Χαρτιά ίσης αξίας με τα νεκρά αφαιρούνται από το τραπέζι και από τα χέρια\n των παικτών.',
    ΟΜΑΔΕΣ: 'Διαλέγετε από τα χαρτιά που απομένουν στη κάτω σειρά.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ανά δύο, ένα πάνω ένα κάτω',
  },
  [GAME_NAMES.CROSS]: {
    ΔΙΑΤΑΞΗ: 'Πέντε χαρτιά σε διάταξη σταυρού.',
    ΟΜΑΔΕΣ: 'Διαλέγετε από οποιαδήποτε τρία σε ευθεία.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ανα δύο -ένα σε κάθε σκέλος- και στο τέλος το κοινό.',
  },
  [GAME_NAMES.CORNER]: {
    ΔΙΑΤΑΞΗ: 'Γωνία 2, 3ων ή 4ων χαρτιών',
    ΟΜΑΔΕΣ: 'Διελέγετε χαρτιά της ίδιας πλευράς.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα ανά δύο -ένα σε κάθε πλευρά- στο τέλος η κορυφή.',
  },
  [GAME_NAMES.QUEEN]: {
    ΠΕΡΙΓΡΑΦΗ:
      'Πόκερ 5 χαρτιών με κάποια απο αυτά ανοικτά και μπαλαντέρ όποιο φύλλο ανοίξει μετά απο την τελευταία ντάμα.(στην περίιπτωση που ανοίξει τελευταίο χαρτί ντάμα, το μπαλαντέρ ακυρώνεται.)',
    ΕΠΙΛΟΓΕΣ: 'Δυνατότητα επιλογής και της ντάμας ως μπαλαντέρ.',
  },
  [GAME_NAMES.PYRAMID]: {
    ΔΙΑΤΑΞΗ: '10 χαρτιά σε διάταξη πυραμίδας.',
    ΟΜΑΔΕΣ:
      'Διελέγετε χαρτιά από οποιάδηποτε σειρά, με τον περιορισμό του ενός χαρτιού ανά σειρά.',
    ΑΝΟΙΓΜΑ: 'Άνοιγμα κάθε σειράς χωριστά, ξεκινώντας απο την βάση.',
  },
});
export const PAYMENT_DESCRIPTION = Object.freeze({
  yearly: 'Ετήσια συνδρομή στο ♠',
  monthly: 'Μηνιαία συνδρομή στο ♠️',
});
export const SUBSCRIPTION_TYPES = Object.freeze({
  ΜΗΝΙΑΙΑ: {
    description:
      'Προστίθεται ένας επιπλέον μήνας (31 μέρες) στην υφιστάμενη συνδρομή σας ή αν δεν έχετε ενεργή συνδρομή αποκτάτε μια μηνιαία.',
    value: 500,
  },
  ΕΤΗΣΙΑ: {
    description:
      'Προστίθεται ένας επιπλέον χρόνος (366 μέρες) στην υφιστάμενη συνδρομή σας ή αν δεν έχετε ενεργή συνδρομή αποκτάτε μια ετήσια.',
    value: 5000,
  },
});
export const SUBSCRIPTION_INSTRUCTIONS = Object.freeze({
  ['ΟΝΟΜΑ ΤΡΑΠΕΖΙΟΥ']:
    'Καταχώρειτε ένα όνομα για το τραπέζι που θα δημιουργήσετε ώστε να είναι αναγνωρίσιμο στην λίστα των διαθέσιμων τραπεζιών.',
  ['ΦΟΡΑ ΜΙΡΑΣΜΑΤΟΣ']:
    'Διαλέγετε μεταξύ αριστερόστροφης ή δεξιόστροφης φοράς μοιράσματος.',
  ΚΑΒΑ: 'Το αρχικό ποσό μονάδων που θα έχει κάθε παίκτης του τραπεζιού. Αποτελεί επίσης το μέγιστο ποσό που μπορεί κάθε παίκτης να ανανεώσει όταν μένει ταπί (παρέχονται επίσης επιλογές ανανέωσης με 20%, 50% ή 80% της κάβας).',
  ΤΣΙΠ: 'Το ελάχιστο ποσό πονταρίσματος.',
  ['ΧΡΟΝΟΣ ΑΝΤΙΔΡΑΣΗΣ']: `Ο χρόνος που θα έχει κάθε παίκτης στην διάθεσή του για να "μιλήσει". Ο χρόνος για να υποβάλλετε το φύλλο σας ή για να αντικαταστήσετε
τα όποια joker (στο παιχνίδι "follow the queen") είναι διπλάσιος αυτού.`,
  ['ΕΝΕΡΓΕΣ ΑΙΤΗΣΕΙΣ']: `Η λίστα με τις αιτήσεις συμμετοχής που έχετε υποβάλλει. Μπορείτε να ακυρώσετε όποια δεν επιθυμείτε πατώντας το αντίστοιχο ❌.
Μπορείτε να αιτηθείτε θέση σε τρία (3) τραπέζια το πολύ.
Με την συμμετοχή σας σε κάποιο τραπέζι ή με το άνοιγμα κάποιου, όλες οι αιτήσεις σας ακυρώνονται.`,
  ['ΔΙΑΘΕΣΙΜΑ ΤΡΑΠΕΖΙΑ']: `Η λίστα με όλα τα ενεργά τραπέζια. 
Επιλέγοντας κάποιο απο αυτά, αποστέλεται αίτηση συμμετοχής στο αντίστοιχο τραπέζι.
Σε πράσινο φόντο εμφανίζονται τα τραπέζια στα οποία έχετε συμμετάσχει και με επιλογή ενός απο αυτά ξανακάθεστε σε αυτό.`,
});
export const ACCOUNT_INSTRUCTIONS = Object.freeze({
  ['ΟΝΟΜΑ ΧΡΗΣΤΗ']: 'Προβολή και επεξεργασία του ονόματος χρήστη.',
  ['ΚΩΔΙΚΟΣ ΕΙΣΟΔΟΥ']: 'Προβολή και επεξεργασία του κωδικού εισόδου.',
  ['ΔΙΑΧΕΙΡΗΣΗ ΣΥΝΔΡΟΜΗΣ']: `Προβολή της κατάστασης της συνδρομής σας και δυνατότητα ανανέωσης αυτής. Μετά απο την επιλογή τύπου συνδρομής, μεταφέρεστε αυτόματα σε ασφαλές περιβάλλον της VivaWallet για την πληρωμή και στην συνέχεια επανακατευθύνεστε στον ιστότοπό μας.`,
  ['ΕΠΑΝΕΚΚΙΝΗΣΗ τελ. ΠΑΙΧΝΙΔΙΟΥ']: `Εδώ, στο τέλος κάθε γύρου, αποθηκεύεται αυτόματα η κατάσταση του τελευταίου τραπεζιού στο οποίο συμμετείχατε.
Επιλέγοντας το, ξανακάθεστε σε αυτό, ενώ αν το τραπέζι δεν είναι ενεργό (απουσιάζουν όλοι οι συμμετέχοντες), επανενεργοποιείται με εσάς ως "ντίλερ" και οι υπόλοιποι συμμετέχοντες μπορούν να ξανακαθήσουν είτε απο το αντίστοιχο μενού στον λογαριασμό τους, είτε απο την λίστα των διαθέσιμων τραπεζιών στο "σαλλούν".
(Λειτουργεί ως "αντίγραφο ασφαλείας" του παιχνιδιού. Μπορείτε να διακόψετε οποιαδήποτε στιγμή και να το συνεχίσετε αργότερα.)`,
  ΡΥΘΜΙΣΕΙΣ: `-Εμφάνιση αναδυόμενων πληροφοριών: Ρυθμίζετε αν επιθυμείτε να εμφανίζονται αναδυόμενες πληροφορίες όταν τοποθετείτε τον δείκτη του ποντικιού πάνω απο συγγεκριμένα μενού ή εικονίδια.
-Χρώμα τράπουλας: Διαλέγετε το χρώμα που επιθυμείτε για το πίσω μέρος της τράπουλας.`,
});
