export const instructions = `
ΟΝΟΜΑ ΧΡΗΣΤΗ:_ Προβολή και επεξεργασία του ονόματος χρήστη.
@ΚΩΔΙΚΟΣ ΕΙΣΟΔΟΥ:_ Προβολή και επεξεργασία του κωδικού εισόδου.
@ΔΙΑΧΕΙΡΗΣΗ ΣΥΝΔΡΟΜΗΣ:_ Προβολή της κατάστασης της συνδρομής σας και δυνατότητα ανανέωσης αυτής. Μετά απο την επιλογή τύπου συνδρομής, μεταφέρεστε αυτόματα σε ασφαλές περιβάλλον της VivaWallet για την πληρωμή και στην συνέχεια επανακατευθύνεστε στον ιστότοπό μας.
@ΕΠΑΝΕΚΚΙΝΗΣΗ τελ. ΠΑΙΧΝΙΔΙΟΥ:_
Εδώ, στο τέλος κάθε γύρου, αποθηκεύεται αυτόματα η κατάσταση του τελευταίου τραπεζιού στο οποίο συμμετείχατε.
Επιλέγοντας το όνομα του, ξανακάθεστε σε αυτό, ενώ αν το τραπέζι δεν είναι ενεργό (απουσιάζουν όλοι οι συμμετέχοντες), επανενεργοποιείται με εσάς ως "ντίλερ" και οι υπόλοιποι συμμετέχοντες μπορούν να ξανακαθήσουν είτε απο το αντίστοιχο μενού στον λογαριασμό τους, είτε απο την λίστα των διαθέσιμων τραπεζιών στο "σαλλούν".
(Λειτουργεί ως "αντίγραφο ασφαλείας" του παιχνιδιού. Μπορείτε να διακόψετε οποιαδήποτε στιγμή και να το συνεχίσετε αργότερα.)
@ΡΥΘΜΙΣΕΙΣ:_
-Εμφάνιση αναδυόμενων πληροφοριών: Ρυθμίζετε αν επιθυμείτε να εμφανίζονται αναδυόμενες πληροφορίες όταν τοποθετείτε τον δείκτη του ποντικιού πάνω απο συγγεκριμένα μενού ή εικονίδια.
-Χρώμα τράπουλας: Διαλέγετε το χρώμα που επιθυμείτε να έχουν τα χαρτιά.
@ΕΝΕΡΓΕΣ ΑΙΤΗΣΕΙΣ:_
Η λίστα με τις αιτήσεις συμμετοχής που έχετε υποβάλλει. Μπορείτε να ακυρώσετε όποια δεν επιθυμείτε πατώντας το αντίστοιχο ❌.
Έχετε δικαίωμα τριών αιτήσεων συμμετοχής σε τραπέζι.
Με την συμμετοχή σας σε κάποιο τραπέζι ή με το άνοιγμα κάποιου, όλες οι αιτήσεις σας ακυρώνονται.
@ΔΙΑΘΕΣΙΜΑ ΤΡΑΠΕΖΙΑ:_
Η λίστα με όλα τα ενεργά τραπέζια. 
Επιλέγοντας κάποιο απο αυτά, αποστέλεται αίτηση συμμετοχής στο αντίστοιχο τραπέζι.
Σε πράσινο φόντο εμφανίζονται τα τραπέζια στα οποία έχετε συμμετάσχει και με επιλογή ενός απο αυτά ξανακάθεστε σε αυτό.`;
