export const gameNames = {
  RAILROAD: 'ΣΙΔΗΡΟΔΡΟΜΟΣ',
  MAMUT: 'ΜΑΜΟΥΘ',
  TRIANGLE: 'ΤΡΙΓΩΝΟ',
  SQUARE: 'ΤΕΤΡΑΓΩΝΟ',
  KOYKOS_MONOS: `ΚΟΥΚΟΣ ΜΟΝΟΣ / "ΠΑΖ ΑΒΟΛΟΝΤΕ"`,
  KOYKOS_DIPLOS: `ΚΟΥΚΟΣ ΔΙΠΛΟΣ / "ΑΒΟΛΟΝΤΕ"`,
  POKER: 'ΠΟΚΕΡ',
  TEXAS_HOLDEM: 'TEXAS HOLDEM',
  TARGET: 'ΣΤΟΧΟΣ',
  CLOCK: 'ΡΟΛΟΙ',
  ELEVATOR: 'ΑΝΣΑΝΣΕΡ',
  GRAVEYARD: 'ΝΕΚΡΟΤΑΦΕΙΟ',
  CROSS: 'ΣΤΑΥΡΟΣ',
  CORNER: 'ΓΩΝΙΑ',
};

export const builderTitles = {
  GAME: 'ΠΑΙΧΝΙΔΙ',
  WINNING_ORDER: 'ΝΙΚΗΤΗΡΙΑ ΣΕΙΡΑ',
  CARDS_IN_HAND: 'ΧΑΡΤΙΑ ΣΤΟ ΧΕΡΙ',
  OPENING: 'ΑΝΟΙΓΜΑ',
  HAND_CARDS_IN_PLAY: 'ΠΑΙΖΟΥΝ ΑΠΟ ΤΟ ΧΕΡΙ',
  DEALING: 'ΜΟΙΡΑΣΜΑ',
  DEALING_OPTIONS: 'ΕΠΙΛΟΓΕΣ ΜΟΙΡΑΣΜΑΤΟΣ',
  OPTIONS: 'ΕΠΙΛΟΓΕΣ',
  EXTRA: 'ΕΞΤΡΑ',
  RAILROAD_LENGTH: 'ΧΑΡΤΙΑ ΣΤΟ ΤΡΑΠΕΖΙ',
  FACE_DOWN: 'ΚΛΕΙΣΤΑ ΧΑΡΤΙΑ',
  CARDS_PER_LEG: 'ΧΑΡΤΙΑ ΑΝΑ ΣΚΕΛΟΣ',
  TABLO: 'ΤΑΜΠΛΟ',
};
export const winningOrders = {
  KENTA_CHROMA: 'ΚΕΝΤΑ ΧΡΩΜΑ',
  TRIA_FOUL: '3 ΦΟΥΛ',
  KENTA_FOUL: 'ΚΕΝΤΑ ΦΟΥΛ',
  MIZERIA: 'ΜΙΖΕΡΙΑ',
};
export const dealingOrders = {
  ENA_ENA: 'ΕΝΑ ΕΝΑ',
  OLA_MAZI: 'ΟΛΑ ΜΑΖΙ',
};
export const tabloCount = {
  MONO: 'ΜΟΝΟ',
  DIPLO: 'ΔΙΠΛΟ',
};
export const cardsName = [
  '',
  '',
  ' ΔΥΟ',
  ' ΤΡΙΑ',
  ' ΤΕΣΣΕΡΑ',
  ' ΠΕΝΤΕ',
  ' ΕΞΙ',
  ' ΕΦΤΑ',
  ' ΟΚΤΩ',
  ' ΕΝΝΕΑ',
  ' ΔΕΚΑ',
  ' ΒΑΛΕ',
  ' ΝΤΑΜΑΣ',
  ' ΡΗΓΑ',
  ' ΑΣΣΟΥ',
];
export const cardsNameOf = [
  '',
  '',
  ' ΔΥΑΡΙΑ',
  ' ΤΡΙΑΡΙΑ',
  ' ΤΕΣΣAΡΙΑ',
  ' ΠΕΝΤΑΡΙΑ',
  ' ΕΞΑΡΙΑ',
  ' ΕΦΤΑΡΙΑ',
  ' ΟΚΤΑΡΙΑ',
  ' ΕΝΝΙΑΡΙΑ',
  ' ΔΕΚΑΡΙΑ',
  ' ΒΑΛΕΔΕΣ',
  ' ΝΤΑΜΕΣ',
  ' ΡΗΓΑΔΕΣ',
  ' ΑΣΣΟΥΣ',
];
export const handKind = {
  SITTING_OUT: 'ΕΚΤΟΣ ΤΡΑΠΕΖΙΟΥ',
  AUTO_SITTING_OUT: 'ΑΠΩΛΕΙΑ ΣΥΝΔΕΣΗΣ',
  FOLDED: 'ΠΑΣΟ',
  HIGH_CARD: 'ΠΕΝΤΑΦΥΛΛΙΑ',
  PAIR: 'ΖΕΥΓΑΡΙ',
  TWO_PAIRS: 'ΖΕΥΓΑΡΙΑ',
  THREE_OF_A_KIND: 'ΤΡΙΑΔΑ',
  STRAIGHT: 'ΚΕΝΤΑ',
  FULL_HOUSE: 'ΦΟΥΛ',
  FLUSH: 'ΧΡΩΜΑ',
  FOUR_OF_A_KIND: 'ΚΑΡΕ',
  STRAIGHT_FLUSH: 'ΦΛΟΣ',
  MIRROR: 'ΚΑΘΡΕΦΤΗΣ',
  ALL_DISCARDED: '"ΞΕΣΚΑΡΤΑΡΙΣΜΑ"',
  SCOOP: 'ΣΚΟΥΠΑ',
};
export const infoText = {
  SKARTO:
    '+1 επιπλέον χαρτί μαζί με το τελευταίο και άμεσως ξεσκαρτάρισμα ενός(αν έχετε επιλέξει π.χ 3 χαρτιά για το χέρι,θα πάρετε 4 και θα απορρίψετε ένα - συνιστάται μοίρασμα ΟΛΑ ΜΑΖΙ -).',
  ARNISI:
    'Τα χαρτιά μοιράζονται ΕΝΑ ΕΝΑ, με αναμονή σε κάθε παίκτη να αποφασήσει αν θα το κρατήσει η θα πάρει άλλο (για όσα χαρτιά έχετε επιλέξει).',
  ALAGI:
    'Αλλαγή όσων χαρτιών επιλέξετε, αφού πάρετε στα χέρια όλα τα χαρτιά και έχετε ποντάρει.',
  HAT: '"Παίζει" μόνο ένα από το καπέλο.',
  BOMBA: `Τα χαρτιά του τραπεζιού (εκτός αυτών του καπέλου) "σκάνε' όλα μαζί.`,
  [dealingOrders.ENA_ENA]:
    'Μοιράζεται από ένα χαρτί σε κάθε παίκτη, ακολουθεί ποντάρισμα, ανοίγει ένα χαρτί στο τραπέζι (αν υπάρχει) και ακολουθεί ποντάρισμα κ.ο.κ ',
  [dealingOrders.OLA_MAZI]:
    'Μοιράζονται όλα τα χαρτία σε παίκτες και στο τραπέζι και ακολουθούν εναλάξ πονταρίσματα και ανοίγματα των χαρτιών του τραπεζιού.',
};
export const errorMessages = {
  ARNISI: 'επιλογή τουλάχιστον ενός χαρτιού για ΑΡΝΗΣΗ\n',
  ALAGI: 'επιλογή τουλάχιστον ενός χαρτιού για ΑΛΛΑΓΗ\n',
  HAND: 'επιλογή τουλάχιστον ενός χαρτιού από το ΧΕΡΙ\n',
  NO_CARDS: 'δεν επαρκούν τα χαρτιά\n',
};
export const orderName = [
  'ΠΡΩΤΟ',
  'ΔΕΥΤΕΡΟ',
  'ΤΡΙΤΟ',
  'ΤΕΤΑΡΤΟ',
  'ΠΕΜΠΤΟ',
  'ΕΚΤΟ',
  'ΕΒΔΟΜΟ',
];
export const count = ['', 'ΜΟΝΟ', 'ΔΙΠΛΟ', 'ΤΡΙΠΛΟ'];
export const countFem = [
  '',
  'ΜΙΑ',
  'ΔΥΟ',
  'ΤΡΕΙΣ',
  'ΤΕΣΣΕΡΕΙΣ',
  'ΠΕΝΤΕ',
  'ΕΞΙ',
  'ΕΦΤΑ',
];
export const infoButtons = {
  GAME_DESCRIPTION: 'ΠΕΡΙΓΡΑΦΗ ΠΑΙΧ.',
  GAME_INFO: 'ΠΑΡΑΛΛΑΓΗ ΠΑΙΧ.',
  LAST_GAME_RESULTS: 'ΑΠΟΤΕΛΕΣΜΑ ΠΑΙΧ.',
  STANDINGS: 'ΚΑΤΑΤΑΞΗ',
  CHAT: 'ΚΟΥΒΕΝΤΑ',
};
export const UNAUTHORISED_REQUEST_ERROR = {
  error: {
    status: 401,
    statusText: 'Άνευ εξουσιοδότησης.',
    data: 'Δεν είστε εξουσιοδοτημένος. Πρέπει να συνδεθείτε πρώτα.',
  },
};
export const ERROR_RESPONSE = responseData => ({
  error: {
    status: 500,
    statusText: 'Κάποιο σφάλμα προέκυψε.',
    data: responseData,
  },
});

export const gamesInfo = {
  [gameNames.RAILROAD]:
    'Όσα χαρτιά επιλέξετε σε μία ευθεία._Διαλέγετε οποιαδήποτε από αυτά._Άνοιγμα ένα ένα.',
  [gameNames.MAMUT]:
    'Τρία χαρτιά σε ευθεία._Διαλέγετε οποιαδήποτε από αυτά._Άνοιγμα ένα ένα._Δυνατότητα επιλογής καθρέφτη (ίδιας αξίας χαρτιά στο χέρι\n και στο τραπέζι) ως ανώτατο φύλλο. ',
  [gameNames.TRIANGLE]:
    'Ισόπλευρο τρίγωνο τριών χαρτιών ανα πλευρά._Διελέγετε χαρτιά από μία πλευρά μόνο._Άνοιγμα ανά τρία, πρώτα οι γωνίες.',
  [gameNames.SQUARE]:
    'Τετράγωνο δύο χαρτιών ανά πλευρά._Διελέγετε χαρτιά από μία πλευρά μόνο._Άνοιγμα ανά δύο διαγώνια.',
  [gameNames.KOYKOS_MONOS]:
    'Πέντε χαρτιά στο τραπέζι σε ευθεία._Διαλέγετε οποιαδήποτε από αυτά._Άνοιγμα ένα ένα.',
  [gameNames.KOYKOS_DIPLOS]:
    'Πέντε χαρτιά στο τραπέζι σε ευθεία._Διαλέγετε οποιαδήποτε από αυτά._Άνοιγμα ένα ένα.',
  [gameNames.POKER]: 'Κανένα χαρτί στο τραπέζι.',
  [gameNames.TEXAS_HOLDEM]:
    'Πέντε χαρτιά στο τραπέζι σε ευθεία._Διαλέγετε οποιαδήποτε από αυτά._Άνοιγμα τριών αρχικά και ενός ενός ύστερα.',
  [gameNames.TARGET]:
    'Έξι χαρτιά σε διάταξη κύκλου και ένα στο κέντρο._Διαλέγετε από οποιαδήποτε δύο συνεχόμενα χαρτιά απο την περιφέρεια\n και το χαρτί του κέντρου._Άνοιγμα ανά δύο αντιδιαμετρικά και στο τέλος το κέντρου.',
  [gameNames.CLOCK]:
    'Έξι χαρτιά σε διάταξη κύκλου._Διαλέγετε από οποιαδήποτε τρία συνεχόμενα χαρτιά απο την περιφέρεια._Άνοιγμα ανά δύο αντιδιαμετρικά',
  [gameNames.ELEVATOR]:
    'Δύο στήλες των τριών χαρτιών και μία ενδιάμεση του ενός._Διαλέγετε από το ενδιάμεσο χαρτί, από ένα χαρτί της πρώτης στήλης\n και το αντίστοιχο χαρτί της δεύτερης._Άνοιγμα κάθε στήλης χωριστά και στο τέλος του ενδιάμεσου χαρτιού.',
  [gameNames.GRAVEYARD]: `Δύο πεντάδες χαρτιών, η πάνω αποτελείται από τα "νεκρά" χαρτιά.\n Χαρτιά ίσης αξίας με τα νεκρά αφαιρούνται από το τραπέζι και από τα χέρια\n των παικτών._Διαλέγετε από τα χαρτιά που απομένουν στη κάτω σειρά._Άνοιγμα ανά δύο, ένα πάνω ένα κάτω`,
  [gameNames.CROSS]:
    'Πέντε χαρτιά σε διάταξη σταυρού._Διαλέγετε από οποιαδήποτε τρία σε ευθεία._Άνοιγμα ανα δύο -ένα σε κάθε σκέλος- και στο τέλος το κοινό.',
  [gameNames.CORNER]:
    'Γωνία 2, 3ων ή 4ων χαρτιών._Διελέγετε χαρτιά της ίδιας πλευράς._Άνοιγμα ανά δύο -ένα σε κάθε πλευρά- στο τέλος η κορυφή.',
};
export const paymentsDescription = {
  yearly: 'Ετήσια συνδρομή στο 🙏',
  monthly: 'Μηνιαία συνδρομή στο 🙏',
  orderGame: 'Παραγγελεία παιχνιδιού.',
};
export const subscriptionOptions = {
  monthly:
    'ΜΗΝΙΑΙΑ_ Προστίθεται ένας επιπλέον μήνας (31 μέρες) στην υφιστάμενη συνδρομή σας ή αν δεν έχετε ενεργή συνδρομή αποκτάτε μια μηνιαία._ 500',
  yearly:
    'ΕΤΗΣΙΑ_ Προστίθεται ένας επιπλέον χρόνος (366 μέρες) στην υφιστάμενη συνδρομή σας ή αν δεν έχετε ενεργή συνδρομή αποκτάτε μια ετήσια._ 5000',
  // orderGame: 'ΠΑΡΑΓΓΕΛΙΑ ΠΑΙΧΝΙΔΙΟΥ',
};
